NCE3/L27 Nothing to sell and nothing to buy.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* Lesson 27 Nothing to sell and nothing to buy
#+begin_verse
What is the most important thing for a tramp?

It has been said that everyone *lives by selling* something.
*In the light of* this statement, teachers live by selling knowledge,
	philosophers by selling wisdom and priests by selling *spiritual comfort*.
Though it may be possible to measure that value of material goods *in terms of money*,
	*it is extremely difficult to* estimate the true value of the services which people perform for us.
There are times when we would willingly give everything we possess to save our lives,
	yet we might *grudge paying* a surgeon a high fee for offering us precisely this service.
The conditions of society are such
	that skills have to be paid for in the same way that goods are paid for at a shop.
Everyone has something to sell.

Tramps *seem to be the only exception to this general rule*.
Beggars almost sell themselves as human beings to arouse the pity of passers-by.
But real tramps are not beggars.
They have nothing to sell and require nothing from others.
*In seeking independence*, they do not sacrifice their human dignity.
A tramp may ask you for money, but he will never ask you to fell sorry for him.
He has deliberately *chosen to lead* the life he leads and is fully aware of the consequences.
He may never be sure where the next meal is coming from,
	but he *is free from* the thousands of anxieties which afflict other people.
His few material possessions make it possible for him to move from place to place *with ease*.
By having to sleep *in the open*,
	he gets far closer to the world of nature than most of us ever do.
He may hunt, beg, or steal occasionally to keep himself alive;
	he may even, in times of real need, do a little work;
	but he will never sacrifice his freedom.
We often speak of tramps *with contempt* and put them in the same class as beggars,
	but how many of us can honestly say that
		we have not *felt a little envious of* their simple way of life and their freedom from care?
#+end_verse
** expression
philosopher: [fɪˈlɑsəfər] n.哲学家
wisdom: [ˈwɪzdəm] n.智慧
priest: [prist] n. vicar 神父
spiritual: [ˈspɪrɪtʃuəl] adj.精神上的
grudge: [ɡrʌdʒ] v.n. a feeling of dislike for someone because you cannot forget that they harmed you in the past不愿给
surgeon: [ˈsɜrdʒən] n. a doctor who does operations in a hospital外科大夫
passer-by: ['pɑːsə] n. passers-by过路人
dignity: [ˈdɪɡnəti] n.尊严
deliberately: [dɪˈlɪb(ə)rətli] adv.故意地
consequence: [ˈkɑnsəkwəns] n.后果,结果
afflict: [əˈflɪkt] v.折磨
ease: [iz] n. easy to do it容易
nature: [ˈneɪtʃər] n.大自然
contempt: [kənˈtempt] n.轻蔑
envious: [ˈenviəs] adj. wanting something that someone else has嫉妒的

question/doubt the wisdom of (doing) sth.: 质疑做某事是否明智
give sb. spiritual comfort: 给某人精神上的安慰
grudge doing sth.: 不愿意做某事
have/hold a grudge against sb.: 对某人怀恨在心
die/treat/do sth. with dignity: 有尊严地xx
have consequences: 产生后果
be afflicted with/by sth.: 被某事折磨
with great/considerable ease: 很容易地
love of nature: 热爱大自然
speak of/treat sb./sth. with contempt: 轻蔑对待/谈起某人
be/feel/get/become envious of sb.: 嫉妒某人
--------------------
live by doing sth.: 以做某事为生
in the light of sth./in light of: 鉴于某事
in terms of sth.: 从某物来说
It is difficult to do sth.: 做某事困难
seem to be/do sth.: 似乎是/做某事
be the exception to the rule: 规则的例外情况
in doing sth.: 结果是
choose to do sth.: 选择做某事
be free from sth.: 摆脱某事
in the open (air): 露天

** words
philosopher [fəˈlɑːsəfər] n. 哲学家
wisdom [ˈwɪzdəm] n. 智慧
priest [priːst] n. 牧师
spiritual [ˈspɪrɪtʃuəl] adj. 精神上的
grudge [ɡrʌdʒ] v. 不愿给,舍不得给
surgeon [ˈsɜːrdʒən] n. 外科大夫
passer-by [ˌpæsər ˈbaɪ] n. 过路人
dignity [ˈdɪɡnəti] n. 尊严
deliberately [dɪˈlɪbərətli] adv. 故意地
consequence [ˈkɑːnsɪkwens] n. 后果
afflict [əˈflɪkt] v. 使苦恼,折磨
ease [iːz] n. 容易;舒适
nature [ˈneɪtʃər] n. 大自然
contempt [kənˈtempt] n. 蔑视
envious [ˈenviəs] adj. 羡慕的;嫉妒的

** vocabulary
value: worth
estimate: assess
perform: do
possess: have, own
grudge: be unwilling to do sth.
precisely: exactly
skills: abilities

