English/NCE3/L27 Nothing to sell and nothing to buy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-28 Sat 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org537638f" class="outline-2">
<h2 id="org537638f">Lesson 27 Nothing to sell and nothing to buy</h2>
<div class="outline-text-2" id="text-org537638f">
<p class="verse">
What is the most important thing for a tramp?<br />
<br />
It has been said that everyone <b>lives by selling</b> something.<br />
<b>In the light of</b> this statement, teachers live by selling knowledge,<br />
&#xa0;philosophers by selling wisdom and priests by selling <b>spiritual comfort</b>.<br />
Though it may be possible to measure that value of material goods <b>in terms of money</b>,<br />
&#xa0;<b>it is extremely difficult to</b> estimate the true value of the services which people perform for us.<br />
There are times when we would willingly give everything we possess to save our lives,<br />
&#xa0;yet we might <b>grudge paying</b> a surgeon a high fee for offering us precisely this service.<br />
The conditions of society are such<br />
&#xa0;that skills have to be paid for in the same way that goods are paid for at a shop.<br />
Everyone has something to sell.<br />
<br />
Tramps <b>seem to be the only exception to this general rule</b>.<br />
Beggars almost sell themselves as human beings to arouse the pity of passers-by.<br />
But real tramps are not beggars.<br />
They have nothing to sell and require nothing from others.<br />
<b>In seeking independence</b>, they do not sacrifice their human dignity.<br />
A tramp may ask you for money, but he will never ask you to fell sorry for him.<br />
He has deliberately <b>chosen to lead</b> the life he leads and is fully aware of the consequences.<br />
He may never be sure where the next meal is coming from,<br />
&#xa0;but he <b>is free from</b> the thousands of anxieties which afflict other people.<br />
His few material possessions make it possible for him to move from place to place <b>with ease</b>.<br />
By having to sleep <b>in the open</b>,<br />
&#xa0;he gets far closer to the world of nature than most of us ever do.<br />
He may hunt, beg, or steal occasionally to keep himself alive;<br />
&#xa0;he may even, in times of real need, do a little work;<br />
&#xa0;but he will never sacrifice his freedom.<br />
We often speak of tramps <b>with contempt</b> and put them in the same class as beggars,<br />
&#xa0;but how many of us can honestly say that<br />
&#xa0;&#xa0;we have not <b>felt a little envious of</b> their simple way of life and their freedom from care?<br />
</p>
</div>
<div id="outline-container-orgcc78efe" class="outline-3">
<h3 id="orgcc78efe">expression</h3>
<div class="outline-text-3" id="text-orgcc78efe">
<p>
philosopher: [fɪˈlɑsəfər] n.哲学家<br />
wisdom: [ˈwɪzdəm] n.智慧<br />
priest: [prist] n. vicar 神父<br />
spiritual: [ˈspɪrɪtʃuəl] adj.精神上的<br />
grudge: [ɡrʌdʒ] v.n. a feeling of dislike for someone because you cannot forget that they harmed you in the past不愿给<br />
surgeon: [ˈsɜrdʒən] n. a doctor who does operations in a hospital外科大夫<br />
passer-by: ['pɑːsə] n. passers-by过路人<br />
dignity: [ˈdɪɡnəti] n.尊严<br />
deliberately: [dɪˈlɪb(ə)rətli] adv.故意地<br />
consequence: [ˈkɑnsəkwəns] n.后果,结果<br />
afflict: [əˈflɪkt] v.折磨<br />
ease: [iz] n. easy to do it容易<br />
nature: [ˈneɪtʃər] n.大自然<br />
contempt: [kənˈtempt] n.轻蔑<br />
envious: [ˈenviəs] adj. wanting something that someone else has嫉妒的<br />
</p>

<p>
question/doubt the wisdom of (doing) sth.: 质疑做某事是否明智<br />
give sb. spiritual comfort: 给某人精神上的安慰<br />
grudge doing sth.: 不愿意做某事<br />
have/hold a grudge against sb.: 对某人怀恨在心<br />
die/treat/do sth. with dignity: 有尊严地xx<br />
have consequences: 产生后果<br />
be afflicted with/by sth.: 被某事折磨<br />
with great/considerable ease: 很容易地<br />
love of nature: 热爱大自然<br />
speak of/treat sb./sth. with contempt: 轻蔑对待/谈起某人<br />
be/feel/get/become envious of sb.: 嫉妒某人<br />
</p>
<hr />
<p>
live by doing sth.: 以做某事为生<br />
in the light of sth./in light of: 鉴于某事<br />
in terms of sth.: 从某物来说<br />
It is difficult to do sth.: 做某事困难<br />
seem to be/do sth.: 似乎是/做某事<br />
be the exception to the rule: 规则的例外情况<br />
in doing sth.: 结果是<br />
choose to do sth.: 选择做某事<br />
be free from sth.: 摆脱某事<br />
in the open (air): 露天<br />
</p>
</div>
</div>

<div id="outline-container-orge0ee033" class="outline-3">
<h3 id="orge0ee033">words</h3>
<div class="outline-text-3" id="text-orge0ee033">
<p>
philosopher [fəˈlɑːsəfər] n. 哲学家<br />
wisdom [ˈwɪzdəm] n. 智慧<br />
priest [priːst] n. 牧师<br />
spiritual [ˈspɪrɪtʃuəl] adj. 精神上的<br />
grudge [ɡrʌdʒ] v. 不愿给,舍不得给<br />
surgeon [ˈsɜːrdʒən] n. 外科大夫<br />
passer-by [ˌpæsər ˈbaɪ] n. 过路人<br />
dignity [ˈdɪɡnəti] n. 尊严<br />
deliberately [dɪˈlɪbərətli] adv. 故意地<br />
consequence [ˈkɑːnsɪkwens] n. 后果<br />
afflict [əˈflɪkt] v. 使苦恼,折磨<br />
ease [iːz] n. 容易;舒适<br />
nature [ˈneɪtʃər] n. 大自然<br />
contempt [kənˈtempt] n. 蔑视<br />
envious [ˈenviəs] adj. 羡慕的;嫉妒的<br />
</p>
</div>
</div>

<div id="outline-container-orgf419e27" class="outline-3">
<h3 id="orgf419e27">vocabulary</h3>
<div class="outline-text-3" id="text-orgf419e27">
<p>
value: worth<br />
estimate: assess<br />
perform: do<br />
possess: have, own<br />
grudge: be unwilling to do sth.<br />
precisely: exactly<br />
skills: abilities<br />
</p>
</div>
</div>
