NCE3/L27 Nothing to sell and nothing to buy.org
** DONE 单词造句
CLOSED: [2023-12-10 Sun 22:16]
philosopher n.
- I could not avoid being influenced by the philosopher.
- In his effort to sell wisdom, everyone soon get used to the philosopher.
- The philosopher never want to get something for nothing.
- My teacher enabled me to be a philosopher.
- The philosopher came along with a little lamb.
wisdom n.  question/doubt the wisdom of (doing) sth.
- People in the town began to question the wisdom of his prediction.
- I don't question the wisdom of our boss any longer.
- I question the wisdom of buying house from the real estate in China.
- Do you question the wisdom of my buying the weapon from America?
- It is anticipated that people will doubt the wisdom of the leader's decision at the beginning.
priest n.
- The priest is always rasing money for one cause or another.
- The priest who was naked captured the attention of people at the monostery.
- The priest devised a plan to have the clock repaired.
- The priest provided us with free samples of a special type of perfume.
- If the priest say the magic word, police will arrive on the scene.
spiritual adj.  give sb. spiritual comfort
- I pride myself on giving my wife spiritual comfort.
- I have been influenced by my aunt, for she gave me spiritual comfort in my youth.
- After given spiritual comfort, I felt I had a subtle mind.
- You should have given your lover spiritual comfort.
- There is no doubt that you should give your lover spiritual comfort when she is upset.
grudge v.n.  grudge doing sth.  have/hold a grudge against sb.
- I grudge giving my nephew pocket money on non-holidays.
- She grudges classifing tramps as beggars.
- She deviese a way to be free from import duty, for she grudges paying the taxes.
- There is a danger that she grudges paying the bill.
- My daughter grudges showing her uncle to the guest room.
6. I had ever held a grudge against my aunt who brought me up. 
surgeon n.
- The death of the surgeon marked the beginning of an era.
- The button was fitted with the gate by the surgeon.
- The surgeon delaid in having an operation because of traffic jam.
- The surgeon had always taken the lead in his class in his youth.
- The surgeon has been struck by a heavy car accident and is still unconscious.
passer-by n. passers-by
- There is a danger that a passer-by may spot us stealing the shop.
- There was a time when passers-by were very friendly.
- It gave me the impression that the passer-by was leaping out at me.
- These passers-by were showed to the camp.
- It made passers-by hair stood on end that they quarreled bitterly.
dignity n.  die/treat/do sth. with dignity
- It became impossible to treat us with dignity in other country.
- She was struck by a heavy storm during the competition and died with dignity.
- It is all very well that a soldier died with dignity.
- I am petrified of not being treated with dignity.
- To varying degrees, we all want to be treated with dignity.
deliberately adv.
- The medical student ruined my day deliberately.
- Why do you get into such a mess deliberately?
- Why do you take away my keys in the drawer deliberately?
- He concealed the sweets from me deliberately.
- He asked her to stay for dinner deliberately.
consequence n.  have consequences
- She knocked him to the ground without considering consequence.
- She concealed everything that happened yesterday from the police without considering consequence.
- Don't hide his underwears. It has consequences.
- My stomach will turn at the idea of consequences.
- The sad truth is that your action has consequences.
afflict v.  be afflicted with/by sth.
- I has been afflicted with this or that anxiety all the time.
- The heroine has been afflicted with a skeleton in the cupboard day and night.
- To my surprise, she was still afflicted with this rare disease.
- If you sticked to your plan, you would not be afflicted with fear.
- I am afflicted with fear at the idea of studying abroad.
ease n.  with great/considerable ease
- I noticed him reading science fiction with ease.
- The enemy will take possession of our city with considerable ease.
- She wrote dozens of postcard with easa in her room.
- After having an operation, she took a stroll with ease.
- People in China associated octopus with food with great ease.
nature n.  love of nature
- My parents often read novels on nature, as I have a great love of nature.
- She is eager to be close to the nature on weekends.
- The paper was written out in full and explained her love of nature.
- She was cast in the role of a woman who has a great love of nature.
- She would play the role of a prizefighter who has a great love of nature.
contempt n.  speak of/treat sb./sth. with contempt
- She has cause to speak of these English teacher with contempt.
- You needn't have spoken of them with contempt in public.
- You should treat your rival with contempt.
- She is always treating her friends with contempt, for she has a better salary than them.
- I insisted that I should not be treated with contempt.
envious adj.  be/feel/get/become envious of sb.
- I never get envious of other students who get a better salary than me.
- Colleagues were envious of her breaking the world record.
- I have cause to feel envious of him.
- I bet that you get envious of your sisiter.
- My wife became envious of my success, then we quarrel bitterly.

** DONE 反复听电影片段直到懂关键句
CLOSED: [2023-12-11 Mon 21:30]
** 复习二册语法(笔记或视频) & 红皮书
