English/NCE3/L27 Nothing to sell and nothing to buy.html

<div id="outline-container-org117232a" class="outline-3">
<h3 id="org117232a"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org117232a">
<p>
philosopher n.<br />
</p>
<ul class="org-ul">
<li>I could not avoid being influenced by the philosopher.<br /></li>
<li>In his effort to sell wisdom, everyone soon get used to the philosopher.<br /></li>
<li>The philosopher never want to get something for nothing.<br /></li>
<li>My teacher enabled me to be a philosopher.<br /></li>
<li>The philosopher came along with a little lamb.<br /></li>
</ul>
<p>
wisdom n.  question/doubt the wisdom of (doing) sth.<br />
</p>
<ul class="org-ul">
<li>People in the town began to question the wisdom of his prediction.<br /></li>
<li>I don't question the wisdom of our boss any longer.<br /></li>
<li>I question the wisdom of buying house from the real estate in China.<br /></li>
<li>Do you question the wisdom of my buying the weapon from America?<br /></li>
<li>It is anticipated that people will doubt the wisdom of the leader's decision at the beginning.<br /></li>
</ul>
<p>
priest n.<br />
</p>
<ul class="org-ul">
<li>The priest is always rasing money for one cause or another.<br /></li>
<li>The priest who was naked captured the attention of people at the monostery.<br /></li>
<li>The priest devised a plan to have the clock repaired.<br /></li>
<li>The priest provided us with free samples of a special type of perfume.<br /></li>
<li>If the priest say the magic word, police will arrive on the scene.<br /></li>
</ul>
<p>
spiritual adj.  give sb. spiritual comfort<br />
</p>
<ul class="org-ul">
<li>I pride myself on giving my wife spiritual comfort.<br /></li>
<li>I have been influenced by my aunt, for she gave me spiritual comfort in my youth.<br /></li>
<li>After given spiritual comfort, I felt I had a subtle mind.<br /></li>
<li>You should have given your lover spiritual comfort.<br /></li>
<li>There is no doubt that you should give your lover spiritual comfort when she is upset.<br /></li>
</ul>
<p>
grudge v.n.  grudge doing sth.  have/hold a grudge against sb.<br />
</p>
<ul class="org-ul">
<li>I grudge giving my nephew pocket money on non-holidays.<br /></li>
<li>She grudges classifing tramps as beggars.<br /></li>
<li>She deviese a way to be free from import duty, for she grudges paying the taxes.<br /></li>
<li>There is a danger that she grudges paying the bill.<br /></li>
<li>My daughter grudges showing her uncle to the guest room.<br /></li>
<li>I had ever held a grudge against my aunt who brought me up.<br /></li>
</ul>
<p>
surgeon n.<br />
</p>
<ul class="org-ul">
<li>The death of the surgeon marked the beginning of an era.<br /></li>
<li>The button was fitted with the gate by the surgeon.<br /></li>
<li>The surgeon delaid in having an operation because of traffic jam.<br /></li>
<li>The surgeon had always taken the lead in his class in his youth.<br /></li>
<li>The surgeon has been struck by a heavy car accident and is still unconscious.<br /></li>
</ul>
<p>
passer-by n. passers-by<br />
</p>
<ul class="org-ul">
<li>There is a danger that a passer-by may spot us stealing the shop.<br /></li>
<li>There was a time when passers-by were very friendly.<br /></li>
<li>It gave me the impression that the passer-by was leaping out at me.<br /></li>
<li>These passers-by were showed to the camp.<br /></li>
<li>It made passers-by hair stood on end that they quarreled bitterly.<br /></li>
</ul>
<p>
dignity n.  die/treat/do sth. with dignity<br />
</p>
<ul class="org-ul">
<li>It became impossible to treat us with dignity in other country.<br /></li>
<li>She was struck by a heavy storm during the competition and died with dignity.<br /></li>
<li>It is all very well that a soldier died with dignity.<br /></li>
<li>I am petrified of not being treated with dignity.<br /></li>
<li>To varying degrees, we all want to be treated with dignity.<br /></li>
</ul>
<p>
deliberately adv.<br />
</p>
<ul class="org-ul">
<li>The medical student ruined my day deliberately.<br /></li>
<li>Why do you get into such a mess deliberately?<br /></li>
<li>Why do you take away my keys in the drawer deliberately?<br /></li>
<li>He concealed the sweets from me deliberately.<br /></li>
<li>He asked her to stay for dinner deliberately.<br /></li>
</ul>
<p>
consequence n.  have consequences<br />
</p>
<ul class="org-ul">
<li>She knocked him to the ground without considering consequence.<br /></li>
<li>She concealed everything that happened yesterday from the police without considering consequence.<br /></li>
<li>Don't hide his underwears. It has consequences.<br /></li>
<li>My stomach will turn at the idea of consequences.<br /></li>
<li>The sad truth is that your action has consequences.<br /></li>
</ul>
<p>
afflict v.  be afflicted with/by sth.<br />
</p>
<ul class="org-ul">
<li>I has been afflicted with this or that anxiety all the time.<br /></li>
<li>The heroine has been afflicted with a skeleton in the cupboard day and night.<br /></li>
<li>To my surprise, she was still afflicted with this rare disease.<br /></li>
<li>If you sticked to your plan, you would not be afflicted with fear.<br /></li>
<li>I am afflicted with fear at the idea of studying abroad.<br /></li>
</ul>
<p>
ease n.  with great/considerable ease<br />
</p>
<ul class="org-ul">
<li>I noticed him reading science fiction with ease.<br /></li>
<li>The enemy will take possession of our city with considerable ease.<br /></li>
<li>She wrote dozens of postcard with easa in her room.<br /></li>
<li>After having an operation, she took a stroll with ease.<br /></li>
<li>People in China associated octopus with food with great ease.<br /></li>
</ul>
<p>
nature n.  love of nature<br />
</p>
<ul class="org-ul">
<li>My parents often read novels on nature, as I have a great love of nature.<br /></li>
<li>She is eager to be close to the nature on weekends.<br /></li>
<li>The paper was written out in full and explained her love of nature.<br /></li>
<li>She was cast in the role of a woman who has a great love of nature.<br /></li>
<li>She would play the role of a prizefighter who has a great love of nature.<br /></li>
</ul>
<p>
contempt n.  speak of/treat sb./sth. with contempt<br />
</p>
<ul class="org-ul">
<li>She has cause to speak of these English teacher with contempt.<br /></li>
<li>You needn't have spoken of them with contempt in public.<br /></li>
<li>You should treat your rival with contempt.<br /></li>
<li>She is always treating her friends with contempt, for she has a better salary than them.<br /></li>
<li>I insisted that I should not be treated with contempt.<br /></li>
</ul>
<p>
envious adj.  be/feel/get/become envious of sb.<br />
</p>
<ul class="org-ul">
<li>I never get envious of other students who get a better salary than me.<br /></li>
<li>Colleagues were envious of her breaking the world record.<br /></li>
<li>I have cause to feel envious of him.<br /></li>
<li>I bet that you get envious of your sisiter.<br /></li>
<li>My wife became envious of my success, then we quarrel bitterly.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orga8ed3e2" class="outline-3">
<h3 id="orga8ed3e2"><span class="done DONE">DONE</span> 反复听电影片段直到懂关键句</h3>
<div class="outline-text-3" id="text-orga8ed3e2">
</div>
</div>
<div id="outline-container-org606b3c6" class="outline-3">
<h3 id="org606b3c6">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
