NCE3/L27 Nothing to sell and nothing to buy.org
** DONE 习惯用法造句
CLOSED: [2023-12-10 Sun 22:16]
live by doing sth.
- She lives by fighting for prize money.
- She want to live by performance.
- I never dream of living by singing.
- She managed to live by programming.
- These gangster live by asking for protection money.
in the light of sth./in light of
- In the light of problems we're having, we have no choice but to put them out of business.
- In light of argument of them, they had to fight against each other.
- In light of everything that recently happened, both countries have to be at war with each other.
- In light of the statement, I am not the exception to the rule.
- In light of the statement, the agreement has reached.
in terms of
- I prefer to think of things in terms of friendship.
- She has a habit of thinking of everything in terms of friendship.
- It is clear that we must turn against each other in terms of money.
- A set of rules were drawn up in terms of fighters' health.
- You should have thought of it in terms of money.
It is difficult to do sth.
- It is difficult to take a shower after an operation.
- It is difficult to believe in god.
- It is difficult to stick to our plan all the time.
- It is difficult to read story to my brother.
- It is difficult to stare at the torchlight all the time.
seem to be/do sth.
- She seemed to play a joke on him.
- She seemed to present follower to him.
- In the dim light, she seemed to get angry.
- They seem to fight against each other with bare fists.
- They seemed to have settled the argument.
be the exception to the rule
- Because she had a rare disease, she was the exception to the rule.
- He wasn't the exception to the rule and died in poverty.
- She was disappointed bitterly that she was the exception to the rule.
- Techinically speaking, you are not the exception to the rule.
- On the same day, I was the exception to the rule.
in doing sth.
- In attempting to finish my work, I has learnt a lot.
- In keeping my word, she rewarded me with a large bar of chocolate.
- In offering her pocket money, I changed my mind.
- In going to the police, I was stuck by a car accident.
- In remaining anonymous, she studied abroad.
choose to do sth.
- I chose to give you electric shocks.
- She chooses to fish on weekends.
- I chose to study Java rather than JS while studying in Zhengzhou.
- I have an opportunity to become a surgeon, I chose to be a programmer.
- I have the impulse to hit him, I chose to get away from him.
be free from sth.
- Everything you bought is not free from taxes.
- Because of operation, she is totally free from pain.
- The mobile phone must be free from the computer while you are live.
- You should be free from fear.
- When the report came to London, people were free from fear of invasion.
in the open (air)
- They will give five performance in the open.
- Working in the open has given him a lot of satisfaction.
- I have the impulse to play out in the open.
- In working in the open, I have a good appetite.
- She may have a good appitite in the open.

** 跟读 50遍
** DONE Comprehension 反复练习
CLOSED: [2023-12-11 Mon 21:33]
** DONE Ask me if 写+读
CLOSED: [2023-12-11 Mon 21:39]
1. Teachers live by selling knowledge. How
	 How do teachers live?
2. It is difficult to estimate the value of services that people perform. How difficult
		How difficult is it to estimate the value of services that people perform?
3. We would give up everything to save our lives. Why
		Why would we give up everything?
4. Everyone's got something to sell. What
		What has everyone got to sell?
5. Beggars sell themselves as human beings. Why
		Why do beggars sell themselves as human beings.
6. A tramp will ask you for money. Who
	 Who will ask you for money?
7. A tramp has deliberately chosen the life he leads. What
	 What has a tramp deliberately chosen?
8. He is free from thousands of anxieties. Which anxieties
	 Which anxieties is he free from?
9. He gets closer to nature than most of us do. How
	 How does he get closer to nature than most of us do?
10. A tramp will do a little work. When
		When will a tramp do a little work.
	 
** DONE 摘要写作 写 & 对答案
CLOSED: [2023-12-11 Mon 21:55]
A tramp may ask you for money, but he will never ask you to feel sorry for him.
He may not be sure where the next meal is,
	but he is free from anxieties which afflict other people.
Because he has few material possessions, it is easy for him to move from place to place.
He has to sleep in the open.
To keep himself alive, he may hunt, beg, steal occassionaly and do a little work.

Unlike beggars, real tramps have nothing to sell and require nothing from others.
Although they seek independence, they will not sacrifice their human dignity.
They choose their own way of life and are aware of the consequences.
They may not know where the next meal is coming from,
	but they do not have the worries that others have.
They can travel easily because they have few possessions
	and when they sleep in the open, they are close to nature.

** DONE tell the story 口语复述
CLOSED: [2023-12-11 Mon 21:57]
** DONE composition 阅读 或 写作
CLOSED: [2023-12-11 Mon 22:02]
The majority of adults in society contribute to society by working.
They work, earn money and pay taxes for the things we all need
	-- hospitals, schools, public transport, the fire brigade, law and order and so on.
We don't expect children or very old people to work and pay taxes.
But everyone else should.
So why should people like tramps and beggars be different?
Tramps say all they want is their freedom.
Well, they may be free, but their freedom is paid for by everyone else in society.
There are many unemployed people who simply cannot get a job
	-- but they would work if they could.
And many beggars are people who have turned to begging because they cannot find a job.

Tramps are not like them.
Tramps lead a very selfish way of life
	and it is a way of life that shows an unwillingness to assume responsibility for others.
The rest of us have a home, children, work, and so on.
But not tramps!
Tramps are lazy parasites on society,
	and if we all had their mentality, society would not exist for them or anyone else.
Although we might in someways be envious of tramps,
	and although we might envy their freedom,
	how many of us could be as selfish as them?
How many of us could say 'damn the rest of society!'? I couldn't.

** Topics for discussion
