English/NCE3/L27 Nothing to sell and nothing to buy.html
<div id="outline-container-org732b79d" class="outline-3">
<h3 id="org732b79d"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-org732b79d">
<p>
live by doing sth.<br />
</p>
<ul class="org-ul">
<li>She lives by fighting for prize money.<br /></li>
<li>She want to live by performance.<br /></li>
<li>I never dream of living by singing.<br /></li>
<li>She managed to live by programming.<br /></li>
<li>These gangster live by asking for protection money.<br /></li>
</ul>
<p>
in the light of sth./in light of<br />
</p>
<ul class="org-ul">
<li>In the light of problems we're having, we have no choice but to put them out of business.<br /></li>
<li>In light of argument of them, they had to fight against each other.<br /></li>
<li>In light of everything that recently happened, both countries have to be at war with each other.<br /></li>
<li>In light of the statement, I am not the exception to the rule.<br /></li>
<li>In light of the statement, the agreement has reached.<br /></li>
</ul>
<p>
in terms of<br />
</p>
<ul class="org-ul">
<li>I prefer to think of things in terms of friendship.<br /></li>
<li>She has a habit of thinking of everything in terms of friendship.<br /></li>
<li>It is clear that we must turn against each other in terms of money.<br /></li>
<li>A set of rules were drawn up in terms of fighters' health.<br /></li>
<li>You should have thought of it in terms of money.<br /></li>
</ul>
<p>
It is difficult to do sth.<br />
</p>
<ul class="org-ul">
<li>It is difficult to take a shower after an operation.<br /></li>
<li>It is difficult to believe in god.<br /></li>
<li>It is difficult to stick to our plan all the time.<br /></li>
<li>It is difficult to read story to my brother.<br /></li>
<li>It is difficult to stare at the torchlight all the time.<br /></li>
</ul>
<p>
seem to be/do sth.<br />
</p>
<ul class="org-ul">
<li>She seemed to play a joke on him.<br /></li>
<li>She seemed to present follower to him.<br /></li>
<li>In the dim light, she seemed to get angry.<br /></li>
<li>They seem to fight against each other with bare fists.<br /></li>
<li>They seemed to have settled the argument.<br /></li>
</ul>
<p>
be the exception to the rule<br />
</p>
<ul class="org-ul">
<li>Because she had a rare disease, she was the exception to the rule.<br /></li>
<li>He wasn't the exception to the rule and died in poverty.<br /></li>
<li>She was disappointed bitterly that she was the exception to the rule.<br /></li>
<li>Techinically speaking, you are not the exception to the rule.<br /></li>
<li>On the same day, I was the exception to the rule.<br /></li>
</ul>
<p>
in doing sth.<br />
</p>
<ul class="org-ul">
<li>In attempting to finish my work, I has learnt a lot.<br /></li>
<li>In keeping my word, she rewarded me with a large bar of chocolate.<br /></li>
<li>In offering her pocket money, I changed my mind.<br /></li>
<li>In going to the police, I was stuck by a car accident.<br /></li>
<li>In remaining anonymous, she studied abroad.<br /></li>
</ul>
<p>
choose to do sth.<br />
</p>
<ul class="org-ul">
<li>I chose to give you electric shocks.<br /></li>
<li>She chooses to fish on weekends.<br /></li>
<li>I chose to study Java rather than JS while studying in Zhengzhou.<br /></li>
<li>I have an opportunity to become a surgeon, I chose to be a programmer.<br /></li>
<li>I have the impulse to hit him, I chose to get away from him.<br /></li>
</ul>
<p>
be free from sth.<br />
</p>
<ul class="org-ul">
<li>Everything you bought is not free from taxes.<br /></li>
<li>Because of operation, she is totally free from pain.<br /></li>
<li>The mobile phone must be free from the computer while you are live.<br /></li>
<li>You should be free from fear.<br /></li>
<li>When the report came to London, people were free from fear of invasion.<br /></li>
</ul>
<p>
in the open (air)<br />
</p>
<ul class="org-ul">
<li>They will give five performance in the open.<br /></li>
<li>Working in the open has given him a lot of satisfaction.<br /></li>
<li>I have the impulse to play out in the open.<br /></li>
<li>In working in the open, I have a good appetite.<br /></li>
<li>She may have a good appitite in the open.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org1f8606e" class="outline-3">
<h3 id="org1f8606e">跟读 50遍</h3>
</div>
<div id="outline-container-org40f2991" class="outline-3">
<h3 id="org40f2991"><span class="done DONE">DONE</span> Comprehension 反复练习</h3>
<div class="outline-text-3" id="text-org40f2991">
</div>
</div>
<div id="outline-container-orgd8d2549" class="outline-3">
<h3 id="orgd8d2549"><span class="done DONE">DONE</span> Ask me if 写+读</h3>
<div class="outline-text-3" id="text-orgd8d2549">
<ol class="org-ol">
<li>Teachers live by selling knowledge. How<br />
How do teachers live?<br /></li>
<li>It is difficult to estimate the value of services that people perform. How difficult<br />
How difficult is it to estimate the value of services that people perform?<br /></li>
<li>We would give up everything to save our lives. Why<br />
Why would we give up everything?<br /></li>
<li>Everyone's got something to sell. What<br />
What has everyone got to sell?<br /></li>
<li>Beggars sell themselves as human beings. Why<br />
Why do beggars sell themselves as human beings.<br /></li>
<li>A tramp will ask you for money. Who<br />
Who will ask you for money?<br /></li>
<li>A tramp has deliberately chosen the life he leads. What<br />
What has a tramp deliberately chosen?<br /></li>
<li>He is free from thousands of anxieties. Which anxieties<br />
Which anxieties is he free from?<br /></li>
<li>He gets closer to nature than most of us do. How<br />
How does he get closer to nature than most of us do?<br /></li>
<li>A tramp will do a little work. When<br />
When will a tramp do a little work.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org0e65d55" class="outline-3">
<h3 id="org0e65d55"><span class="done DONE">DONE</span> 摘要写作 写 &amp; 对答案</h3>
<div class="outline-text-3" id="text-org0e65d55">
<p>
A tramp may ask you for money, but he will never ask you to feel sorry for him.<br />
He may not be sure where the next meal is,<br />
	but he is free from anxieties which afflict other people.<br />
Because he has few material possessions, it is easy for him to move from place to place.<br />
He has to sleep in the open.<br />
To keep himself alive, he may hunt, beg, steal occassionaly and do a little work.<br />
</p>

<p>
Unlike beggars, real tramps have nothing to sell and require nothing from others.<br />
Although they seek independence, they will not sacrifice their human dignity.<br />
They choose their own way of life and are aware of the consequences.<br />
They may not know where the next meal is coming from,<br />
	but they do not have the worries that others have.<br />
They can travel easily because they have few possessions<br />
	and when they sleep in the open, they are close to nature.<br />
</p>
</div>
</div>

<div id="outline-container-orgc86d01d" class="outline-3">
<h3 id="orgc86d01d"><span class="done DONE">DONE</span> tell the story 口语复述</h3>
<div class="outline-text-3" id="text-orgc86d01d">
</div>
</div>
<div id="outline-container-org2aa9e9a" class="outline-3">
<h3 id="org2aa9e9a"><span class="done DONE">DONE</span> composition 阅读 或 写作</h3>
<div class="outline-text-3" id="text-org2aa9e9a">
<p>
The majority of adults in society contribute to society by working.<br />
They work, earn money and pay taxes for the things we all need<br />
	&#x2013; hospitals, schools, public transport, the fire brigade, law and order and so on.<br />
We don't expect children or very old people to work and pay taxes.<br />
But everyone else should.<br />
So why should people like tramps and beggars be different?<br />
Tramps say all they want is their freedom.<br />
Well, they may be free, but their freedom is paid for by everyone else in society.<br />
There are many unemployed people who simply cannot get a job<br />
	&#x2013; but they would work if they could.<br />
And many beggars are people who have turned to begging because they cannot find a job.<br />
</p>

<p>
Tramps are not like them.<br />
Tramps lead a very selfish way of life<br />
	and it is a way of life that shows an unwillingness to assume responsibility for others.<br />
The rest of us have a home, children, work, and so on.<br />
But not tramps!<br />
Tramps are lazy parasites on society,<br />
	and if we all had their mentality, society would not exist for them or anyone else.<br />
Although we might in someways be envious of tramps,<br />
	and although we might envy their freedom,<br />
	how many of us could be as selfish as them?<br />
How many of us could say 'damn the rest of society!'? I couldn't.<br />
</p>
</div>
</div>

<div id="outline-container-org3553c01" class="outline-3">
<h3 id="org3553c01">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
